{
    "pages": [
        {
            "page_number": 1,
            "content": ""
        },
        {
            "page_number": 2,
            "content": ""
        },
        {
            "page_number": 3,
            "content": ""
        },
        {
            "page_number": 4,
            "content": ""
        },
        {
            "page_number": 5,
            "content": ""
        },
        {
            "page_number": 6,
            "content": ""
        },
        {
            "page_number": 7,
            "content": ""
        },
        {
            "page_number": 8,
            "content": ""
        },
        {
            "page_number": 9,
            "content": ""
        },
        {
            "page_number": 10,
            "content": ""
        },
        {
            "page_number": 11,
            "content": ""
        },
        {
            "page_number": 12,
            "content": ""
        },
        {
            "page_number": 13,
            "content": ""
        },
        {
            "page_number": 14,
            "content": ""
        },
        {
            "page_number": 15,
            "content": ""
        },
        {
            "page_number": 16,
            "content": ""
        },
        {
            "page_number": 17,
            "content": ""
        },
        {
            "page_number": 18,
            "content": ""
        },
        {
            "page_number": 19,
            "content": ""
        },
        {
            "page_number": 20,
            "content": "To: From: Date: SS Circular No. 37/2021 - All Chief Officers - All D/Chief Officers - All Directors and D/Directors - All Regional Directors - All Branch Managers Chief Executive Officer October 14, 2021 APA ITN AwashBank Subject:- Data Center Access and Operations Procedure Manual Please find enclosed herewith the Data Center Access and Operations Procedure Manual for your perusal and implementation. Softcopy of the Data Center Access and Operations Procedure Manual shall be distributed through the office of D/Chief, Strategy Innovation & Transformation Officer. The Manual shall be put in force effective immediately. __ All recipients of this Circular shall, therefore, ensure that the manual is thoroughly read, understood and properly implemented. Thank you. Encl:- Data Center Access and Operations Procedure Manual Tel.: +251-0115-57-00-65/66| Fax: -0115-57-01-26 | Email:aib.president@awashbank.com"
        },
        {
            "page_number": 21,
            "content": "Pt aT washBank Data Center Physical Security & Access Procedure Manual atin gs, / SF Awastibun"
        },
        {
            "page_number": 22,
            "content": "Awash Bank en ES ACRONYMS BODs Board of Directors CEO Chief Executive Officer clo Chief Information Officer DC Data Center IT Information Technology UPS Uninterrupted Power Supply rere rr ee EST TE TE TEE TEE EE EE Data Center Physical Security & Access Procedure Manual Page 1"
        },
        {
            "page_number": 23,
            "content": "Awash Bank cancer Contents SET IOIN I ses soe seas nos sans vans we 5 a size tid acace oor woes ed unre unc 0 neu nb me met Oe wae KO Sue wk Rena wD Gb acne aaa 3 INTRODUCTION............scesccsccecesceeseetentestensesscuecssesseesesacecsesteveeessessessensenss 3 1.1 BaCkKQrOUN ........... sees eceeceeeseceeteneneeecnscuseecceseuseuceaeenessensentenensseenseususe 3 1.2 Objective of this Procedure Manual .............cccccccccecececcecececeacessceucusscsecevaces 3 1.3. Scope of the Procedure Manual .............cccccccecscececccecececeeseseueneeecuceseeueeeeee 4 1.4 Definition of Terms and Concepts.............cccccececececcececeacecececceseseasuseseescesces 4 SEG TOWN, IIs sens ws mis sis win win si 5 Sits ninsn ane eon arom HW Wun Fa RU ME on HORN KRW BODO UR G RRS OLB db Rd am 5 ORGANIZATIONAL STRUCTURE, ROLES AND RESPONSIBILITIES ............cececcececsececees 5 2.1 Organizational StructUre ............cccececececesecscececccucuceceseseseeeesevesevevensusuens 6 2.2 Roles and Responsibilities ...............cccecesesececececscecuceceseseseseceeseseueeesencuseens 6 SECTION UM as oe ose ene oe pe ware ware ve ewe ns ain wk a Ws Bie Wala Hid kbd Sd Sdld 9 eee oe eos vw pare vere pre ew wer ? DATA CENTER PHYSICAL SECURITY AND ACESS PROCEDURE ITEMS. ...........ecceccecseesee 9 3.1 Access Authorization Levels.............cccccececscscececccaceeueasssnsnessnsesesecususesuceses 9 3.2 Authorized Internal Vendor or Employee .............ccccccecececececcecececececucececesecs 11 3.3. Authorized External Vendor............cccsceccececsccvcucecescececucaceseesececesensusesences 11 Bb VIBTOOIS sii nnae vemoes omaren #9 tHciH 4 # PHAGE A WANNA OUNGEA 8 40008 5 baccace + ecmne vo omerun s rwmaes byuqueey ems 11 3.5 Access Authorization Request ..............ccccececcececececeeeeeeuessesuseseeeacestceceeces 12 2G = Data Center Door + scsives saances sain ssnnce'v'seminare o 4 G55 4 RanW ANDES 4 BURNETT 5 tesaiaa 4 Bachuiam + 12 3.7 Physical SECUrity...........cccececsecececcececcescuceceececesesesesersusesesensesesercecesesees 13 3.8 Data Center Operations...............cccccececcecececcscuceceseseesecucessssuccsegescecesesces 13 3.9 Equipment Care and Installation in the Data Center.............0.066 Bes Besears 4 paar 13 3.10 Equipment REMOVAL .........ccccseeseesseecceceeseettttssseeeceesseceeeesenses wid UE wabstil w ecncrnee 14 3.11 Periodic Review of ACCESS ...........cscceceseccscecccscecucsesenceseceeeseseusecesencesesens 14 3.12 Access Control LOG 1.0.0... ce cecececececececucececcceeeeeeeeseusacatacacucucucesecevecesesncs 15 3.13 Exception Report ...........cccceccececsccecessceeesceceeceseceseseesesucuctsseseveseseecesesees Ta 3.14 Audit ProCedUres 2.0.0... ...ccececcecessecececeseecucuceseesesusaseessuceeeesusesesercecesesces 16 US ESSAI neues umes gs rans # Lasers Rote + oma FoF 1 pammers 1 wee 14 ae EV RAIMA B Ridinoen 0 wemumwe 9 16 SECTION IV 4.1 4.2 4.3 4.4 4.5"
        },
        {
            "page_number": 24,
            "content": "Awash Bank SESS ET SECTION | INTRODUCTION 1.1 Background Data centers are integral repositories for business data. Typically, these central IT infrastructures are served by sophisticated networking equipment and resources. They will take in business data from diverse places, and store it for eventual use. Complex designs may use IT tools called middleware to user data to/from a data center or otherwise guide it within the system. Data center security is the pursuit of practices that make a data center more secure from a range of different kinds of threats and attacks. Data center security aims to make that data less accessible to hackers or anyone else who may seek unauthorized access. The data center, as a major primary resource for companies, deserves a dedicated security effort. One type of data center security is physical security. Experts may recommend various kinds of facilities or site security such as setbacks, landscaping, thick walls, and other aspects of a building that will create physical barriers around the data center. Another main component of data center security is essentially network security. Because data centers are served by networks, security engineers need to plan adequate protections into those network trajectories that run to a data center. That may mean installing firewalls, anti-virus progra nything that prevents data breaches or other security issues. the country, the Data Center Physical Security & Access yeos, , 2% r Nations. 3 Procedure is prepared. ccc ee ed Data Center Physical Security & Access Procedure Manual Page 3"
        },
        {
            "page_number": 25,
            "content": "Awash Bank eee sm pT CS 1.2 Objective of this Procedure Manual The general objective of this procedure manual is to create a harmonized system of management of Data Center Physical Security & Access activities, in the Bank, in accordance with applicable laws and regulations. Specifically, this procedure aims at: a) Providing management with direction and support for Data Center Physical Security and Access. b) Ensuring that the Bank conforms to a standard Data Center Physical Security and Access in such a way that it achieves a balance between ensuring legislative compliance, best practice controls and service efficiency. c) Defining controls to enforce Data Center Physical Security and Access and support activities, so that any risks associated to the management of Data center are mitigated. d) Prescribing mechanisms that help identify and prevent the compromise of Data Center Physical Security and Access and the misuse of the Banks data, applications, networks and computer systems. 1.3 Scope of the Procedure Manual This procedure manual governs issues of Data Center Physical Security & Access activities such as requesting access to the data center, access authorization levels, authorized vendors, data center doors, physical security, access control log, etc. 1.4 Definition of Terms and Concepts Authorized Vendor: refers to all non-Bank employees who, through contractual arrangement and appropriate approvals, have access to the Data Center. Authorized Staff: refers to the Bank employees who are authorized to gain access to the Data Center but who do not work at the Data Center. Data Center: refers to a secured, environmentally controlled _facittty.housing Bank servers, telecommunications and storage. Data Center Coordinator: refers to a person responsibk protect and \\oversee physical access to a data center. Data Center Physical Security & Access Procedure Manual Page 4"
        },
        {
            "page_number": 26,
            "content": "Awash Bank Data Center Employee: refers to a division of IT employees who work at the Data Center. Sponsor: refers to the Bank s employee empowered to request access for another Bank s employee or visitor. When the request is for a Bank s employee, the sponsor is the employee s direct supervisor. When the request is for a visitor, the sponsor is the Bank s employee responsible for the visitor and their actions while in the data center. Visitors: refers to all other personnel who may occasionally visit the Dat are not authorized to be in the Data Center without escort. Data Center Physical Security & Access Procedure Manual Page 5"
        },
        {
            "page_number": 27,
            "content": "Awash Bank eS US ESSE SS ESSE SECTION Il ORGANIZATIONAL STRUCTURE, ROLES AND RESPONSIBILITIES The organizational structure, roles and responsibilities of various organs of the Bank as related to the management of Data Center Physical Security & Access activities are indicated below. 2.1 Organizational Structure Chief Executive Officer Director, Enterprise Riskk& | __ Compliance Mgt. = | _ J ------- Director, Internal Audit Advisory Office Director, Legal Services Director, Customer Experience & Quality Assurance Chief, Information Officer | Director, IT Infrastructure fe f nh i Ns . . & 4) Director, IT Service Vie NF? \\ aT Fs ay nh eg LY) ww fs zfs Gira OF Data Center Physical Security & Access Procedure Manual Page 6"
        },
        {
            "page_number": 28,
            "content": "Awash Bank eee I I EERE EE 2.2 Roles and Responsibilities The roles and responsibilities of various organs of the Bank shall be as listed below. 2.2.1 Chief Executive Officer The major roles and responsibilities of the CEO on Data Center Physical Security and Access activities are: a) Oversee the overall Data Center Physical Security and Access activities of the Bank. However, the CEO may delegate his/her authority to a concerned organ of the Bank or a Committee, as he/she may find it appropriate and necessary. b) Approve the operational procedures and guidelines for the various organs of c) the Bank related to Data Center Physical Security and Access activities. Ensure proper and timely supply of information and required reports to Board of Directors. 2.2.2 Chief Information Officer The major roles and responsibilities of the Chief Officer on Data Center Physical Security and Access activities are: a) b) Supervise the overall Data Center Physical Security and Access activities of the Bank. . , Ensure proper implementation of the Data Center Physical Security and Access Policy, Procedure and Guidelines and takes remedial actions on deviations. Ensure proper and timely supply of information and required reports to the CEO. Ensure that the Data Center Physical Security and Access Policy and Procedures of the Bank are reviewed periodically. Put in place adequate systems and controls over the Data Center Physical Security and Access activities so as to ensure compliance with the NBE s Directives and other related rules and principles. Put in place appropriate strategies, risk management progr titthe-Data Cente Br MW gen, | LH \\2 Bani |] of funding, a and reporting processes in respect of the risks associated Physical Security and Access activities. Review the adequacy and allocation of resources in ff personnel, equipment, and service levels. Data Center Physical Security & Access Procedure Manual Page 7"
        },
        {
            "page_number": 29,
            "content": "Awash Bank Sa EE EE EEE 2.2.3 Internal Audit Directorate The major roles and responsibilities of the Internal Audit Directorate on Data Center Physical Security and Access activities are: a) Direct, supervise and control the establishment and implementation of appropriate internal control systems over Data Center Physical Security and Access related activities. Regularly audit the Bank s Data Center Physical Security and Access related operations and check the correctness of records, compliance to rules and regulations and find out errors, mistakes and any breach of the Bank's Policy and procedures. Follow up and ensure that actions are taken on those who breach the Bank s policies and procedures with relation to Data Center Physical Security and Access activities. Prepare and submit to th ; and/or BODs, as appropriate, reports ysical Security and Access activities. je een a EOS SR Data Center Physical Security & Access Procedure Manual Page 8"
        },
        {
            "page_number": 30,
            "content": "Awash Bank SECTION III DATA CENTER PHYSICAL SECURITY AND ACESS PROCEDURE ITEMS 3.1 Access Authorization Levels The Data Center will a have consolidated server room intended to provide a 24x7x365 high availability, secure environment for systems that need a high level of security. To obtain access to the Data Center, all personnel must have proper authorization and there are three levels of authorization, based on the access required. 3.1.1 Level- Ill Authorization a) Level Ill authorization grants unassisted, unescorted access to the Bank s Data Center 24x7x365. Level III staff members are the only individuals authorized to make infrastructure ao changes (network, cooling, power, etc.), add and/or remove equipment, or perform fixed asset audits (inventory) within the Data Center space. c) Level III authorization is granted to: e Manager, Database, and Systems Administration e Data Center Supervisor/ Principal Officer e Infrastructure team members (network team, Server and storage admin team) e Data Center staff members e Data Center Technical Team - internal IT staff who are appointed to oversee the distribution of electrical power, network connectivity, cooling, and layout of the Data Center. e Level Ill employees are granted security card access. 3.1.2 Level-Il Authorization a) Level II authorization grants unassisted, unescorted access to 24x7x365. responsibilities for the physical maintenance and repair of crit tite equipment housed in the Data Center. Data Center Physical Security & Access Procedure Manual Page 9"
        },
        {
            "page_number": 31,
            "content": "Awash Bank Sa SA SESS SS c) Level Il staff members are not authorized to make any changes, modifications, and/or decisions regarding the Data Center space without explicit approval of the Manager, Database, and Systems Administration or other Level Ill staff members. d) Level Il employees are granted security card access. 3.1.3 Level-l Authorization a) Level | authorization grants escorted assistance to the Data Center during normal weekday business hours (8:00am-5:00pm). b) Access during non-business hours will be granted on a case-by-case basis. c) In the event of an after-hours emergency that cannot wait until the next business day, emergency access to the Data Center can be arranged by contacting the Manager, Database, and Systems Administration or appointed Data Center staff. d) Level | authorized personnel must be escorted at all times by Level II authorized or higher personnel, unless an exception has been granted by the Manager, Database, and Systems Administration. e) Level | authorization is granted to: e Bank employees who request for occasional direct access to perform physical maintenance and/or repair functions. . e Bank employees (contract or permanent, etc.) who assist Level /Il staff with the physical maintenance and repair of critical service equipment housed in the Data Center. f) If an emergency situation requiring physical access to equipment in the Data Center occurs on a holiday or day of administrative closure, arrangements will be in place to provide Level | authorized individual s physical access to the Data Center. For security purposes these arrangements will not be published in this document. | g) Level | authorized individuals will rec Tyennstructi Nor holiday/ administrative closure access from the Manager, Dadti Y. ms Administration or other authorized data center staff. Data Center Physical Security & Access Procedure Manual Page 10"
        },
        {
            "page_number": 32,
            "content": "Awash Bank eee ER ES 3.2 Authorized Internal Vendor or Employee 3.2.1 Authorized Internal Vendors are all Bank employees who, through a contractual arrangement and appropriate approvals, have access to the Data Center. 3.2.2 These employees may or may not be granted security card access. 3.2.3 Access level will be determined on a case-by-case basis. 3.2.4 Authorized Internal Employee may include, but are not limited to: a) Technical and Facilities Staff (electricians, plumbers, etc...) b) Building Services staff c) Cleaning Services staff. 3.3 Authorized External Vendor 3.3.1 Authorized External Vendors are all non-Awash Bank individuals who, through a contractual arrangement with appropriate approval have access to the data center. 3.3.2 External Vendors must be escorted at all times by Level II or higher authorized staff. 3.4 Visitors 3.4.1 Visitors are individuals who do not have Level III/II/I or a vendor level authorization. 3.4.2 This may include IT employees (part time and/or full time) who do not have direct responsibility for the maintenance and repair of equipment housed in the data center. | 3.4.3 All visitors to the data center must adhere to the following: a) Visitors must be logged in and out when entering and exiting the data center. b) The purpose of the visit must be documented. c) Visitors must be accompanied at all times by a Leve Sreolawall * oy ENS he? | piions must have: \\ wan Cs Naa has rae c 4 F washdank || authorized employee while in the data center. All exc data center Manager approval. d) IT employees wishing to enter the data center must ba&accompanied r, a Level Il or higher authorized employee. No advance no Data Center Physical Security & Access Procedure Manual Page 11"
        },
        {
            "page_number": 33,
            "content": "Awash Bank ge e) All non-IT staff/visits to the data center should be scheduled through the - Manager, Database, and Systems Administration at least 24 hours in advance. f) Tour groups are considered visitors to the data center, and any visit must be arranged at least 24 hours in advance, and be approved by the Manager, Database, and Systems Administration. Tour groups are limited to 10 or fewer individuals at one time. 3.5 Access Authorization Request The process to obtain data center authorization is detailed below. 3.5.1 Employee Access a) The Authorized Access Request form must be completed by each employee requesting access to the data center. b) The completed form is forwarded to the employee s Director or Manager for approval. c) The approved form is forwarded to the Manager, Database, and Systems Administration for processing. The Manager, Database, and Systems Administration reserves the right to reject or downgrade any access level request. d) The employee s name is added to the authorization list. e) The employee will be authorized to enter the data center under the guidelines set for the authorization level assigned to that employee. f) The purpose of each visit must be documented. The employee must be logged in and out when entering and exiting the Data Center. 3.5.2 Vendor Access The process for internal and external vendors to obtain data center authorization will be dealt with on a case-by-case basis by the Manager, Database, and Systems Administration or Data Center Supervisor. 3.6 Data Center Doors All doors to the data center must remain locked at all times 4 opened for periods not to exceed that minimally necessany a) Allow officially approved and logged entrance and eXi Data Center Physical Security & Access Procedure Manual ~ = > Page 12"
        },
        {
            "page_number": 34,
            "content": "Awash Bank era b) Permit the transfer of supplies/equipment as directly supervised by a person with full access to the area. c) Properly open the door to the data center only if it is necessary to increase airflow into the data center in the case of air conditioning failure. In this case, staff personnel with full access must be present and limit access to the data center. 3.7. Physical Security 3.7.1 Proximity card access is required for access to the data center doors. 3.7.2 Security cameras are present throughout the data center, including every isle and entrance way. 3.7.3 Cameras are monitored in real-time. Additionally, they continually record and are available for playback when necessary (10-day retention). 3.8 Data Center Operations 3.8.1 Data Center should operate 24/7 without interruption. 3.8.2 For Infrastructure works, the data center staff shall be notified of all work pertaining to infrastructure in the data center. This includes things such as installing, maintaining, patching, and updating the server, storage and network resources. 3.8.3 The Manager, Database, and Systems Administration or Data Center Supervisor ensure all regular operations in the data center are performed without fail. 3.9 Equipment Care and Installation in the Data Center In an effort to maximize security and minimize disruptions, the following shall apply to all equipment housed in the data center: a) Individuals who administer equipment that is housed in the data center should plan feasible, will physical access to the data center be allowed. c) Equipment should be located on racks raised above floor level. eet UE EEE ET EEE Data Center Physical Security & Access Procedure Manual Page 13"
        },
        {
            "page_number": 35,
            "content": "Awash Bank ee ee RS d) The Equipment Installation Form shall be completed for all equipment to be placed in the data center. e) Datacenter staff shall deny entry to authorized staff or vendors who intend to install or change equipment without a properly completed equipment installation form. f) Equipment housed in the data center shall meet certain system specifications. These include: i. All new equipment shall be rack mountable unless prior arrangements have been made to allow a particular non- rack mountable piece of equipment into the room. ii. Equipment that has a business need to be in the room and is currently not rack mountable should be replaced with rack mountable units. If this is not possible, the functions the equipment provides should be relocated to hardware more appropriate for the data center. iii. Mounted power distribution units shall be connected to the data center UPS backed power grid, and must provide remote monitoring capability to the Data Center Supervisor and monitoring systems. g) Placement of new systems and hardware in the data center shall be coordinated with the Data Center Supervisor and/or Data Center Technical Team. h) As the number of systems housed in the data center grows, the infrastructure that supports the data center shall be expanded. This may mean a delay in the deployment of hardware into the data center until the appropriate infrastructure (including console, network, power and rack space) is in place. 3.10 Equipment Removal 3.10.1 The Equipment Removal Form shall be completed for all equipment to be removed from the data center. 3.10.2 Data center staff shall deny entry to unauthorized staff or vendors who a 2 3.11.1 Perio Higeta : anna) reviews will be performed of those with card acce eo the data ceht r. The Data Center Supervisor will perform these Data Center Physical Security & Access Procedure Manual Page 14"
        },
        {
            "page_number": 36,
            "content": "Awash Bank 3.12 3.13 3.11.21f an individual no longer requires data center access, he/she will be denied of access. 3.11.3 The results of periodic reviews will be reported to the CIO. The report will include an updated list of those allowed access to the data center. Access Control Log 3.12.1 Proximity card logs are imported and maintained in the log collection system. 3.12.2 The data center access control log must be properly maintained at all times. 3.12.3 The log is maintained by the data center technical staff. 3.12.4 All individuals with full access to the data center are responsible for maintaining this log. The following procedures must be followed: a) Each time an individual with Escorted Access to the data center is admitted to the area, he/she must properly log in on the Access Control Log at the time of entrance. b) The person admitting the visitor must countersign and fill out the appropriate section of the form. . | c) Each time an individual with Escorted Access to the data center leaves the area, he/she must properly log out on the Access Control Log at the time he leaves (even if only for a short time). d) The person with Full Access to the area who allows the visitor to leave must fill out the Log Out section of the Access Control Log. Exception Report 3.13.1 All infractions of the Data Center Access Policies and Procedures shall be reported to the ClO. 3.13.2 Individuals with Full Access to the area shall monitor the area and remove any individual who appears to be compromising either the Fe oy, area or its activities, or who is disrupting operation. 3.13.3 It is particularly important that individuals with Full \\e ess show a e = arn me | in monitoring and maintaining the security of the d taecenter> sni a Data Center Physical Security & Access Procedure Manual"
        },
        {
            "page_number": 37,
            "content": "Awash Bank Samm ES 3.14 Audit Procedures 3.14.1 The IT auditor will: a) Review the access list for authorized staff on yearly basis. b) Check that entrances and exits to the data center are automatically logged by Access Key Card. 3.14.2 The electronic access log is reviewed quarterly by IT security staff and IT auditor. 3.14.3 The visitor sign in/out log is reviewed half-yearly by IT Auditors. 3.15 Escalation The Manager, Database and System Administration or Data Center supervisor has i 5S ae ~ dministration/\\, overall responsibility for the administration of data Center and P policy and procedure. Issues the Manager, Database and System Director. IT Infrastructure is unable to resolve will be escalated to Data Center Physical Security & Access Procedure Manual Page 16"
        },
        {
            "page_number": 38,
            "content": "Awash Bank i ed SECTION IV ACCESS, EXCEPTIONS, REVISION, REPEAL & REPLACEMENT AND EFFECTIVE DATE 4.1 Access to this Procedure e This Procedure Manual shall be kept in safe custody of the concerned supervisors in confidential manner. e Access to this Procedure Manual shall be limited to the concerned organs/staff of the Bank that make use of it for execution of their duties. 4.2 Exceptions to this Procedure e Any exceptional activities, decisions and communications to this Procedure shall be forwarded to the CEO for approval before implementation. 4.3 Revision of this Procedure e Unless there is exceptional enforcement to revise this Procedure in the meantime, it shall be revised in three years and approved by the CEO. The Director, IT Infrastructure shall initiate and manage the revision of this procedure when the need arises. 4.4 Repeal and Replacement e Any Procedures of the Bank contravening this Procedure, if any, are hereby repealed and replaced with this Data Center Physical Security & Access Procedure. 4.5 Effective Date of this Procedur Noe ee Data Center Phvsical Security & Access Procedure Manual Pace 17"
        }
    ]
}