{
    "pages": [
        {
            "page_number": 1,
            "content": ""
        },
        {
            "page_number": 2,
            "content": ""
        },
        {
            "page_number": 3,
            "content": ""
        },
        {
            "page_number": 4,
            "content": ""
        },
        {
            "page_number": 5,
            "content": ""
        },
        {
            "page_number": 6,
            "content": ""
        },
        {
            "page_number": 7,
            "content": ""
        },
        {
            "page_number": 8,
            "content": ""
        },
        {
            "page_number": 9,
            "content": ""
        },
        {
            "page_number": 10,
            "content": ""
        },
        {
            "page_number": 11,
            "content": "CA FERS 1dd& &@ ATH NATIONAL BANK OF ETHIOPIA ADDIS ABABA LICENSING AND AUTHORIZATION OF PAYMENT INSTRUMENT ISSUER AND PAYMENT SYSTEM OPERATOR Manner of Equity Investment by Foreign Nationals of Ethiopian Origin and Organizations in Payment Instrument Issuance & Payment System Operator Directive No.ONPS/04/2021 Whereas, Foreign Nationals of Ethiopian Origin or Organizations have been allowed to invest in the payment instrument issuance and payment system operator businesses in Ethiopia; Whereas, there is a need to put in place implementation modality for investment by Foreign Nationals of Ethiopian Origin or Organizations in payment instrument issuance and payment operator businesses in Ethiopia; Now, therefore, in accordance with article 4/2a and article 37/2 of National Payment System Proclamation No.718/2011 and articles 9 (1&2) and 58 of Banking Business (as amended) Proclamation no.1159/2019 and articles 20 (2) and 27 (2) of the National Bank of Ethiopia Establishment (as Amended) Proclamation No. 591/2008, the National Bank of Ethiopia has issued this Directive, 1. Short Title This Directive may be cited as Manner of Equity Investment by Foreign Nationals of Ethiopian Origin or Organizations in Payment Instrument Issuer or Payment System Operator Business Directive No.ONPS/04/2021 . 2. Definitions For the purpose of this Directive, unless the context requires otherwise, the term: nee | EEEE R F 10, ARST: (8 WAG 744k, 3550/2048 AN #PC 0115 51 45 88 AN eT 0115 51 ABSHN WD, ADDRESS: SUDAN STRCET P.O.BOX $550/2048 FAX No, 0115514388 TEL. No, 0115517430 ADDIS ABABA TELEGRAPHIC ADDRESS. NA TIONBANK : CODES-USED PETERSON 3%& 4\" ED BENTLEY'S 2 PHRASE 4.B.C, 6\" EDITIO E-mail: nbe.excd@ ethionet.et Website. www. http:// www.nbe.gov.et"
        },
        {
            "page_number": 12,
            "content": "2.1. 2.2, 23. Acceptable Foreign Currency means foreign currency which is declared to be acceptable for payment in Ethiopia by the National Bank and shall include United States Dollar, Great Britain Pound Sterling, Euro and other currencies that the National Bank may specify to be acceptable for this purpose from time to time. Foreign National of Ethiopian Origin means a person with a valid identification card obtained pursuant to Proclamation No. 270/2012 attesting that he/she is a Foreign National of Ethiopian Origin; Mid exchange rate means exchange rate between buying and selling rate of a day set by the National Bank; . National Bank means the National Bank of Ethiopia; . Organization means an entity that is fully owned by Foreign Nationals of Ethiopian 2.6. 27, 2.8. 2:9) origin or jointly by Foreign Nationals of Ethiopian Origin and Ethiopian Nationals, located within or outside Ethiopia. Payment Instrument Issuer means a Payment Instrument Issuer licensed by the National Bank to undertake payment instrument issuance business in Ethiopia; Payment Instrument Issuer (under formation) means a Payment Instrument Issuer that has applied for a payment instrument issuance business license from the National Bank: Payment System Operator means a Payment System Operator licensed by the National Bank to undertake payment system operator business in Ethiopia; Payment System Operator (under formation) means a Payment System Operator that has applied for a payment system operator business license from the National Bank. 3. Scope of Application The provisions of this Directive shall be applicable to existing Payment System Operator and Payment Instrument Issuer and Payment System Operator (under formation) and Payment Instrument Issuer (under formation). i} Li. 4 Page 2 of 10"
        },
        {
            "page_number": 13,
            "content": "4. Share Subscription 4.1. Place of Share Subscription 4.1.1 All subscriptions including initial and subsequent sales of shares to Foreign Nationals of Ethiopian Origin or Organizations shall take place only in the geographical territory of Ethiopia. Notwithstanding the provision stated under sub-article 4.1.1 of this article, a Payment Instrument Issuer or a Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) may conduct promotional and other related preliminary activities needed for share subscription outside Ethiopia. 4.2. Manner of Share Subscriptions and Surrender Requirement 4.2.1. 4.2.2, 4.2.3, 4.2.4, A Payment Instrument Issuer or a Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) shall submit a written application to the National Bank to open foreign currency escrow account for the purpose of accepting share payment indicating the name of the bank and branch (es) where the account is to be opened; and shall report the account number so opened to the National Bank. A bank instructed by the National Bank to surrender 30% (thirty percent) of the foreign currency that is maintained in line with sub-article 4.2.1 of this article shall surrender, to the National Bank, with in five working days from the receipt of the order. Upon receipt of the foreign currency surrendered as per sub-article 4.2.2 of this article and the summary of the share subscription as per Annex-I, the National Bank shall credit the payment and settlement account of the bank with the equivalent amount of Ethiopian Birr at the prevailing mid exchange rate. A bank instructed by the National Bank to unblock the foreign currency escrow account of a newly licensed Payment Instrument Issuer or Payment System Operator shall transfer the Birr equivalent of the full amount of the foreign currency collected and maintained in Page 3 of 10"
        },
        {
            "page_number": 14,
            "content": "the escrow account at a prevailing buying rate to the account of the newly licensed Payment Instrument Issuer or Payment System Operator. 4.2.5, Notwithstanding the provisions stated under sub-article 4.2.1 herein above, a Payment Instrument Issuer or Payment System Operator shall open a foreign currency bank account with the National Bank s approval for accepting share payment and share premium (if any) from Foreign Nationals of Ethiopian Origin or Organizations. 4.2.6. The bank that maintained the foreign currency account as per sub-article 4.2.5 of this article, shall surrender 30% (thirty percent) of the foreign currency collected from subscription of shares to the National Bank in accordance with Foreign Exchange Surrender Requirements of Banks (as amended) Directives No. FXD/54/2018 and transfer the Birr equivalent of full amount of the foreign currency collected to the account of the payment instrument issuer or payment system operator at the prevailing buying rate. 4.3. Payment of Share Subscriptions 4.3.1. Payment of the full value of initially subscribed shares and share premium (if any) by Foreign Nationals of Ethiopian Origin or Organizations shall be made in acceptable foreign currency. 4.3.2. Dividend generated from investment activities of Foreign Nationals of Ethiopian Origin or Organizations in other sectors and deemed eligible for repatriation by the National Bank can be used for the purpose of share purchase in a Payment Instrument Issuer or a ayment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation). 4.3.3, The funds to be paid by Foreign Nationals of Ethiopian Origin or Organizations for the urpose of share purchase shall be transferred to the account opened and maintained in a ank for this purpose only through banking system. 4.3.4. Notwithstanding the provision stated under sub-article 4.3.3 hereinabove, Foreign ationals of Ethiopian Origin or Organizations having a Non-Resident Foreign Currency / / Page 4 of 10"
        },
        {
            "page_number": 15,
            "content": "43.5. Account with local banks may transfer the foreign currency deposited in this account for the purpose of share purchase, Transfer of funds made by Foreign Nationals of Ethiopian Origin or Organizations for the purpose of share purchase through foreign payment cards, cash whether declared or not and international money transfer organizations that cannot generate credit advice at individual level showing the identity, amount and purpose of the transfer, shall not be allowed, In the case of investment in a Payment Instrument Issuer or Payment System Operator or a Payment Instrument Issuer (under formation) or Payment System Operator (under formation) by an organization owned by Ethiopian Nationals and Foreign Nationals of Ethiopian Origin, payment of share subscription in foreign currency shall be made to the extent of percentage shareholding of Foreign Nationals of Ethiopian Origin in that organization while the remaining subscription balance can be paid in Ethiopian Birr. 4.4. Verification and Validation of Subscribed Shares 4.4.1. 4.4.2. 4.4.3. A Payment Instrument Issuer or a Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) that floats the shares shall assume the responsibility of ensuring compliance with sub-article 4.3 of this Directive. A Payment Instrument Issuer or a Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) shall ensure matters related to proper identification of the Foreign Nationals of Ethiopian Origin or Organizations (including its shareholders), proper execution of bank transfer detail and documentation and submission of documents including list of subscribers, subscriber s nationality identification documents and foreign currency credit advice and any other related documents to the National Bank. To ensure that the share subscription has been made in line with this Directive and other relevant laws, Payment Instrument Issuer (under formation) or Payment System Operator (under formation) that sold shares to Foreign Nationals of Ethiopian Origin or Vi | Page 5 of 10 Lo CA"
        },
        {
            "page_number": 16,
            "content": "Organizations shall ensure that the share subscriptions and related payments are audited along with the audit of pre-establishment costs and submit the report to the National Bank accordingly. 4.4.4. A Payment Instrument Issuer and Payment System Operator shall develop comprehensive 4.4.5, policies and procedures for handling of share subscription by Foreign Nationals of Ethiopian Origin or Organizations. Accordingly, the policies and procedures, among others, shall address: * promotion and share subscription process; \"identification of Foreign Nationals of Ethiopian Origin or Organizations (including its shareholders); \" payment details and modalities of share subscription; \"foreign currency surrender to the National Bank; and \" share transfer involving Foreign Nationals of Ethiopian Origin or Organizations (including its shareholders). A Payment Instrument Issuer or Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) shall ensure that a person or shareholders of an organization who acquires a share through transfer or any means holds a valid document evidencing his/her nationality and other related status. 5. Share Transfer 5. $.2. a3. A share may be transferred from Ethiopian Nationals to Foreign Nationals of Ethiopian Origin or Organizations through sell in acceptable foreign currency transferred through banks at a share price not less than par value, Shares shall not be acquired by Foreign Nationals of Ethiopian Origin or Organizations through donation. Shares may be transferred from Ethiopian Nationals to Foreign Nationals of Ethiopian Origin through succession. Sa poly LA Page 6 of 10"
        },
        {
            "page_number": 17,
            "content": "6. 6.1. 6.2. Dividend Payment Dividends earned as a result of investment in a Payment Instrument Issuer or a Payment System Operator by Foreign Nationals of Ethiopian Origin or Organizations shall be paid in Ethiopian Birr, and shall not be repatriated. Dividends earned in accordance with sub-article 6.1 of this article may be used for purchase and payment of newly issued and subscribed shares in the same Payment Instrument Issuer or Payment System Operator. 7. Reporting Tl. Teds 8. A Payment Instrument Issuer or a Payment System Operator or a Payment Instrument Issuer (under formation) or a Payment System Operator (under formation) shall report summary of share subscription by Foreign Nationals of Ethiopian Origin or Organizations to, the National Bank with supporting documents, as per sub article 4.4.2 and Annex I of this Directive along with application for Payment Instrument Issuer or Payment System Operator business license. A Payment Instrument Issuer or Payment System Operator shall submit summary of share subscribed by Foreign Nationals of Ethiopian Origin or Organizations to the National Bank, as per sub article 4.4.2 and Annex II and III of this Directive, on a quarterly basis, In case of no subscription during the quarter, a Payment Instrument Issuer or Payment System Operator may submit a Nil report. Effective Date This Directive shall be effective as of 1 day of July 2021. : ell < fK fe (PRDD Page 7 of 10"
        },
        {
            "page_number": 18,
            "content": "OT JO gaseg VW 4 suOHeziuRsIO JaysuBly KauoWUNosY AduUaLND UBI910,{ JUSPIS21-UON, n requiosqns ay) Aq usodap Jo ayep aty uo ayes ay st area SurAng Suyerdid j asasisoxanasaunannonmeaccmpsaNaREREEE aeq Sree tenses ceeneneneneneeeseenes apc SS ODESSA ameusig ommeusig SIN Wa peer Wibiet wtleee uonisog wolIsog &g poaoiddy Ag peredaig jyuNOWe pa.ispuata Te0], ZO.LW/ (@) (dev) =O (a) wv VOWIN/LATAS (a-3)=4 (aug a) (ang uy) aaeyg | paquasqn: ysnoayy prea paysodap Sukng | S248uS su junowy junowy yoeg jo souey: ON doquasqng 9 payrwey | Suypeaoig | tpueys3no dn preg uondiissqng | anjea seg | jo aaquin yodsseg] Ajyjeuonen oy} Jo auleN) ON seuleRUNCeKe Ase :poLtag Suns0day Sr eeereseeneeeeeeeers {(MOHBULIOS J9pUN) 10}E.19dG w1a384g JUDUEABY 10 (UONEUTIOY AepuN) Adnssy jUUNAYSUT pUOMEARY 94) JO auleN, UOHEZULSIO 10 UIs ueidorgygy Jo S[BUOneNy Wso10y Aq wondosqng a1eqS jo Areoramg vido Jo yaeg peuonen (woneuii0y sapun) s0}e.19dQ wiajsXg yuaWALg 10 (uoneuioy aapun) Jonssy juIUINIySUT JUDWABY 10 10)8.419dQ wWaj}ssg qudWABY 10 Jonssy yuaUINAySUT quaudvg 104) | xouuy"
        },
        {
            "page_number": 19,
            "content": "OT 40 6 a8ed O} Sareys Mou [euOTppe Jo LONdLOSqns Woy wo N apjoyamys UU 0} SaBYS MOU ou eZIULBIQ Jaysue1y KauoW/uNosay KoudLN?) ugJsue.N oueYs WO ,11 JI LS pur soreys Surpueysino jo jawed wo stat f1 SOd Apoyazeys 3 - NN Sunes Aq sores Jo uo: ~gaquosgns ayy Aq jisodep Jo ayep ayy uo ayes ay) Ss} ayes SurAng Bu boe 40 100 * omeUsig Sig bain ainis Nisin Soin ini siege einie'e ed on uoTIsOg OE NN ae ETO TSO &g poaoiddy Ag poredaig e0L ,OL W/VOAUN /LAIMS ysnoiyy a-O=4 (@ (dav)=9 (vy) paysodap | ,uonisinboy Ovea (44g up | Garg un) (241g ut) (a) paquosqns y aaeys | Suidng 3 | sezeys Su | junomy junoury aaBys yoRy soieys ON daqiasqns poyiwiay josquueyy | upeaotg | ipueysing | dn preg | wondisosqng | jo onje, seg jo saquiny] qaodsseg AUPEUOHEN 3y} JO aWEN ON :popury Jawend ey) 10.) vidoryyy jo yueg [euoueN, WOHCzZUCSIG 10 UISIIQ ULIdOIg} y JO S[eUOHEN] UdI0I04 AG SUOTULOSqnS sAeYy ApO}AEN 2 RENEE SY woyeledg woyskg quourdeg JO Jonss] JuoWMsUT JUoWARG oY} JO UIE Jj xouay"
        },
        {
            "page_number": 20,
            "content": "OT J9 OT a8eq Mette te tttetttnettiteeeisereeeeeesensens aed omnyeusig aunyeUusig scnstnateacnsisess saan SEs uonsog sete eeeietereetereerseeetereiess UONISOd, Ke ponoiddy trrtttenteeentenenteteeseeseees dq paredaig jyunOWY opua.Ling [10], e901, OLIW/VOAUN/LAIMS (@) (a2v)=9 | (a) Gua (v) ON! AQBUOHeN | Jaqiiosqns ey) Jo oWBN | ON ysno1yy (q-3)=a) Gung up) (aarg ut) | uy) aaeys] paquiasqns | q10dsswq| pausodap payrumey saieys| junoury junowy yoeq jo sa.1eys Surpurysjng| dn preg | wondiiosqns) onjea aeg] jo saquinyy opug JoVeNgd oy} 10,f seinen terincieltinerintie reese uoyerodg wiaysXg yuowAeY JO Jonssy JuoWMsUy wWoWARY oY) JO sue SUOneZMESIQ 10 UlsliGQ ULIdoMgyy JO SeUOHEN UsIo10 Gg Aq SUOTNAMOsqng sey yo Aivmumeg oAneynum,) HOTTA Jo yueg Peo ENT Ti ouny"
        }
    ]
}