{
    "pages": [
        {
            "page_number": 1,
            "content": ""
        },
        {
            "page_number": 2,
            "content": ""
        },
        {
            "page_number": 3,
            "content": ""
        },
        {
            "page_number": 4,
            "content": ""
        },
        {
            "page_number": 5,
            "content": ""
        },
        {
            "page_number": 6,
            "content": ""
        },
        {
            "page_number": 7,
            "content": ""
        },
        {
            "page_number": 8,
            "content": ""
        },
        {
            "page_number": 9,
            "content": ""
        },
        {
            "page_number": 10,
            "content": ""
        },
        {
            "page_number": 11,
            "content": ""
        },
        {
            "page_number": 12,
            "content": ""
        },
        {
            "page_number": 13,
            "content": ""
        },
        {
            "page_number": 14,
            "content": "PATEL Ndhc-k IWIN dillitm NATIONAL BANK OF ETHIOPIA ADDIS ABABA TELAGRAPHIC ADDRESS PLEASE ADDRESS ANY REPLY TO Licensing and rvision of Bankin. eSS Cheque Account Operation Directives No. SBB/64/2016 WHEREAS, proper use of a cheque as payment instrument is crucial in facilitating smooth and cashless exchange of goods and services; WHEREAS, cheque as a negotiable instrument is recognized and given legal protection under Ethiopian laws; WHEREAS, the National Bank of Ethiopia is entrusted with the responsibility of creating and maintaining efficient, safe and sound payment systems; WHEREAS, there is a need to determine the manner of proper operation of cheque of a bank and thereby to ensure its safety and credibility as the payment instrument; NOW, THEREFORE, the National Bank of Ethiopia has issued these Directives pursuant to the authority vested in it by Article 27(2) of National Bank of Ethiopia Establishment Proclamation (as amended) No. 591/2008. 1. Short Title These Directives may be cited as Cheque Account Operation Directives No. SBB/63/2016 . 2. Definition For the purpose of these Directives: 2.1 bank means a company licensed by the National Bank to undertake banking business or a bank owned by the Government; 2.2. cheque means the meaning ascribed to it under the Ethiopian Commercial Code; 2.3 cheque account means any account operated by cheque; 2.4 close an account means terminating operation (debiting and crediting) of a cheque account or deactivating a cheque account; 2.5 delinquent list means a record maintained at the National Bank and each bank containing detail information about a cheque dishonored for the third time reported by a bank to the National Bank and circulated to/all-banks by the National Bank in line with sub-article 7.3 of these directives:"
        },
        {
            "page_number": 15,
            "content": "RATERS Ae Ath National Bank of Ethiopia 2.6 dishonored cheque means a cheque drawn without sufficient fund cover in the account and is rejected by paying bank for this reason; 2.7 dishonored cheque register means a register maintained by a bank in which particulars stipulated under sub-article 7.2 of these directives are recorded; 2.8 drawer means a cheque account holder who signs on a cheque giving an order to his bank to pay the amount specified therein to a payee using funds in his cheque account maintained in the bank; 2.9 National Bank means the National Bank of Ethiopia; 2.10 person means any natural or juridical person; 2.11 stop-cheque-payment order means an instruction issued by a cheque account holder to its bank to cancel cheque payment(s); 2.12 any expression in the masculine gender includes feminine. 3. Scope of the Directives The Provisions of these directives shall be applicable to all banks operating in Ethiopia. 4. General Requirements 4.1. Upon opening of a cheque account, a bank shall: 4.1.1. verify that the name of a person requesting to open the cheque account does not appear in delinquent list; 4.1.2 request the person to produce at a minimum taxpayer registration certificate/TIN; 4.1.3. inform its customer about the use and purpose of cheque account, cheque, and the consequences of misusing them; and 4.1.4 include in the cheque account opening agreement a clause about the measures that shall be taken when there is misuse of cheque in accordance with these directives and the bank s internal policies and procedures. 4.2 If a person has multiple cheque accounts in various branches of a bank, the bank shall aggregate all the cheque accounts in its branches and treat them as a single account for purpose of closing the cheque account. 4.3 A bank shall request existing customers to produce tax identification number (TIN) within six months from effective date of these directives, after which the b: not issue new cheque book unless the account holders produce the number."
        },
        {
            "page_number": 16,
            "content": "RATERS 1hek Wh sdilitin National Bank of Ethiopia z 4.4 Without prejudice to the generality of sub-article 4.1 of this article, a bank shall develop and put in place its own internal policies and procedures on proper operation of cheque. 5. Action to be Taken by a Bank Upon Dishonoring a Cheque 5.1 Dishonoring a Cheque for the First Time 5.1.1 Upon dishonoring a cheque drawn by a drawer for the first time any period after opening of a cheque account in line with article 4 of these directives, the bank shall: a) record the incident for the first time in the Dishonored Cheque Register: and b) block all debit (outgoing) transactions against this account until the dishonored cheque is fully paid to the payee or equivalent amount is blocked pending the payment to the payee. .1.2 An account holder whose incident has been recorded in the Dishonored Cheque Register in line with 5.1.1(a) hereinabove but who has fulfilled all obligations related to dishonored cheque which includes full settlement of the claim or blocking of equivalent amount and has not drawn other dishonored cheques for the second time at least for 12 consecutive months following such registration, may be deleted from such register and be considered as clean. 5.1.3 All dishonored cheques presented to a bank before deleting the name of a drawer from the Dishonored Cheque Register in line with 5.1.2 hereinabove shall be treated as the second and third time dishonored cheques, even if two or more cheques have been presented at a time or simultaneously by the same payee. 5.2 Dishonoring a Cheque for the Second Time 5.2.1 Upon dishonoring a cheque drawn by a drawer for the second time within 12 consecutive months following the date of presentation of the dishonored cheque to the bank for the first time under 5.1.1 hereinabove, the bank shall: a) record the incident for the second time in the Dishonored Cheque Register; b) block all debit (outgoing) transactions against this account until all the cheques which have been dishonored & registered under 5.1.1(a)"
        },
        {
            "page_number": 17,
            "content": "PADPRE Uee Ih (8 National Bank of Ethiopia 5.2.1(@) hereinabove are fully paid or equivalent amount is blocked pending the payment to the payee(s); and ) levy a fine of 3% of the amount appearing on the cheque dishonored for the second time but not exceeding Birr 25,000 (twenty five thousand Bir). 5.2.2 An account holder whose incident has been recorded in the Dishonored Cheque Register in line with 5.2.1(a) hereinabove but who has fulfilled all obligations related to dishonored cheques which includes full settlement of the claims or blocking of equivalent amount and has not drawn other dishonored cheques for the third time at least for 24 consecutive months following the date of presentation of the first dishonored cheque to the bank, may be deleted from such register and be considered as clean. 5.2.3 A dishonored cheque presented to the bank before deleting the name of the drawer from the Dishonored Cheque Register in line with 5.2.2 hereinabove shall be treated as the third time dishonored cheque. 5.3 Dishonoring a Cheque for the Third Time 5.3.1 Upon dishonoring a cheque drawn by a drawer for the third time within 24 consecutive months following the date of presentation of the dishonored cheque to the bank for the first time under 5.1.1 hereinabove, the bank shall: a) record the incident for the third time in the Dishonored Cheque Register; b) close the account, levy a fine of 5% of the amount appearing on the cheque dishonored for the third time but not exceeding Birr 50,000 (fifty thousand Birr) and make every effort possible to collect all unused cheque leaves & pads from the drawer and report same to the National Bank; and c) keep the cheque account of such person closed at all its branches. 5.3.2 A bank shall deny service of cheque account operation using a cheque to a customer whose name has been circulated by the National Bank in line with sub-article 10.2 of these directives; or may allow such customer to operate his cheque account in line with restrictions stipulated under 5.3.3 and maintain the list in line with sub-article 7.3 of these directives, 5.3.3. bank may, after deducting its own receivables from the account, allow a person whose cheque account has been closed in line with 5.3.1 hereinabove to obtain banking services other than those that involve drawing a cheque against cheque account such as payable or other accounts like saving or fixed deposits until the National Bank deletes such drawer s narhe from the delinquent list in line with sub-articles 8.1 of these directives, 4"
        },
        {
            "page_number": 18,
            "content": "RATERS Anek Ath stile National Bank of Ethiopia 5.4 Notwithstanding provisions under 5.1.1(b) and 5.2.1(b) hereinabove upon fulfillment of the condition set under sub-article 5.2.1(c), the bank may unblock the account and make the fund available to the drawer: 5.4.1 if the drawer presents the dishonored cheques to the bank or the payee(s) may appear in person to the bank and confirm in writing that the dishonored cheques have been fully settled in the form prescribed under Annex-I of these directives: or 5.4.2 if the payee(s) fails to appear to receive a full payment after lapse of six months of presenting the dishonored cheque(s). 5.5 Notwithstanding provisions under 5.1.1, 5.2.1 and 5.3.1 hereinabove, a bank may: 5.5.1 debit charges like legal, insurance, advertisement and such other non cash transactions against a blocked account; and 5.5.2 accrue interest against overdraft accounts. 5.6 Deletion of a drawer s name from Dishonored Cheque Register in line with sub- articles 5.1.2 and 5.2.2 of this article shall be subject to quarterly internal audit of the bank. 5.7 Cheques dishonored before the effective date of these directives shall be treated as first, second and third time dishonored cheques, as the case may be, and fulfill all requirements set in these directives, respectively. 6. Prohibiting Cases of Stop-cheque-payment Order 6.1 A bank may not accept a stop-cheque-payment order request of a drawer with a mere 6. 6. 2 pa purpose of evading the punishments stipulated under article 5 hereinabove of these directives. For the purpose of sub-article 6.1 hereinabove, a stop-cheque-payment order request shall be presumed to have been made with a mere purpose of evading the punishments stipulated under article 5 hereinabove of these directives if: 6.2.1 the request was made at the moment when the cheque account of the drawer was not covered with sufficient funds to satisfy the claim of a payee as was written on a specific cheque at the issuing and/or presenting dates for payment; and 6.2.2 the drawer fails to produce police evidence within 15 working days following the date the cheque was presented for payment to prove the stop-cheque-payment order was in fact requested as the cheque was lost or stolen Except as established otherwise under sub-article 6.2 hereinabove, a bank may not consider whatsoever reason as a valid autpnomous ground to accept or reject stop- cheque-payment order of the drawer."
        },
        {
            "page_number": 19,
            "content": "PAPERS ek APH National Bank of Ethiopia 7. Maintenance of Dishonored Cheques Register and Delinquent List WW 72 73 A bank shall maintain the Dishonored Cheque Register. Without prejudice to the generality of sub-article 7.1 hereinabove, the Dishoriored Cheque Register shall at a minimum include the following particulars: 7.2.1 name and address of the bank and its branch dishonoring a cheque; 7.2.2. name, tax identification number and address of an account holder who issued a dishonored cheque: 7.2.3. date on which the cheque was dishonored and frequency of drawing dishonored cheque; amount of money stated in the dishonored cheque; reference number of dishonored cheque; name of beneficiary; and the action taken by the bank. The National Bank and all other banks shall maintain the delinquent list containing name of a cheque account holder which has been circulated by the National Bank to the banking industry when a cheque which has been drawn by a drawer is dishonored for third time. 8. Conditions for Deleting the Name of a Drawer from Delinquent List and Reinstatement 8.1 of Closed Cheque Account Without prejudice to the discretion of a bank under sub-article 5.3.2 hereinabove, the National Bank may lift the restriction set on the cheque account operation upon fulfillment of the following conditions: 8.1.1 the drawer is suspended from use of cheque account for a minimum of 12 consecutive months effective from the date of closure of the account by the bank; 8.1.2 the drawer shall present satisfactory evidences that all cheques which have been dishonored & registered under sub-articles 5.1.1(a), 5.2.1(a) and 5.3.1(a) of these directives are fully settled or produce a letter from the bank which indicates equivalent amount of funds have been blocked pending the payment to the payee(s). Under such circumstance, a call to collect the stated money within specified date and bank shall be made by the drawer, at his own cost, to the payee in widely cj ewspaper at least once per week for three consecutive weeks; or"
        },
        {
            "page_number": 20,
            "content": "PARPRE Ae Ah National Bank of Ethiopia < 8.1.3. if the drawer is unable to trace the whereabouts of the dishonored cheques which have been registered under sub-articles 5.1.1(a), 5,2.1(a) and 5.3.1(a) of these directives after full settlement of the cheques value to the payee(s), the payee(s) may appear in person to the National Bank and confirm in writing that the dishonored cheques have been fully settled in the form prescribed under Annex -I of these directives; or keep equivalent amount in a blocked account pending a call to collect the stated money within specified date and bank to be made by the drawer, at his own cost, to the payee in widely circulating newspaper at least once per week for three consecutive weeks; 8.1.4 the drawer shall produce a letter from his bank that amount of penalties charged in line with article 5 of these directives have been fully settled; 8.1.5 the drawer shall file a written application with the National Bank, with a copy to the Federal Police Commission, attested by an oath to indicate his intention and commitment to use a cheque in operating his cheque account honestly and carefully in the future; and 8.1.6. the drawer shall present an undertaking in a duly completed and signed letter as specified under Annex-II to these directives; 82 A bank shall provide cheque account service to the person whose name has been deleted from the delinquent list in line with the preceding sub-articles of this article. 8.3 The National Bank and each other bank shall maintain a separate register for the names of persons deleted from delinquent list. 84 If the payee fails to appear and collect the funds blocked under 8.1.2 or 8.1.3 hereinabove after specific date stated in a newspaper call made in line with the same sub-articles, the bank may unblock the account and make the funds available to the drawer. 9 Conditions for Allowing New Cheque Account Opening to a Person Prohibited Because of Similar Name in the Delinquent List 9.1 Notwithstanding provisions under sub-article 8.1 hereinabove, the National Bank may allow a person, who has been prohibited from opening new cheque account because of similar name in the delinquent list, upon fulfillment of the following conditions: 9.1.1 the person shall file a written application with the bank that initially closed the cheque account in the form prescribed under Annex-III of these directives, with a copy to the National Bank, Banking Supervision Directorate; 9.1.2 within 10 calendar days of receiving the written application under 9.1.1 hereinabove, the bank shall produce satisfactory evidences that assure wheth r"
        },
        {
            "page_number": 21,
            "content": "RATERS ek 17h National Bank of Ethiopia the closed account is of the person or not to the National Bank, Banking Supervision Directorate; 9.1.3 the National Bank, upon receiving satisfactory evidences in line with 9.1.2 hereinabove, shall allow a bank to open new cheque account if the closed account isnot of the person and eieulate same to the banking industry, with a copy to the applicant; and 9.1.4 a bank may open a cheque account in line with sub-article 4.1 of these directives to a customer whose name has been circulated by the National Bank in line with sub-article 9.1.3 hereinabove. 10 Reporting and Information Sharing 10.1 10.2 10.3 10.4 10.5 11 Repeal A bank shall send a report to the National Bank, Banking Supervision Directorate, regarding customers whose cheque accounts are closed in line with sub-article 5.3.1(b) of these directives in the form prescribed under Annex-IV, on the following five working days from the date of such closure, The National Bank shall compile the reports received from banks in line with the preceding sub-article of this article and circulate same in the banking industry, with a copy to the Federal Police Commission. The National Bank shall also circulate to the banking industry the name of cheque account holder deleted from the delinquent list in line with sub-article 8.1 of these directives. A bank shall circulate reports received from the National Bank in line with sub-articles 10.2 and 10,3 hereinabove to all its branches within three working days from the date of receiving such reports; with a copy to the National Bank, Banking Supervision Directorate. A bank shall also circulate name of a drawer who has been recorded in the Dishonored Cheque Register in line with sub-articles 5.1.1(a), 5.2.1(a) and 5.3.1(a) of these directives at the end of every month to all its branches in the form prescribed under Annex-V to update respective branches database. eal Directive No. SBB/31/2002 is hereby repealed and replaced by these directives. 12 Effective Date These Directives shall enter into force as of the 1\" day of December 2016"
        },
        {
            "page_number": 22,
            "content": "RATERS hee 17h National Bank of Ethiopia Annex- | PTs a am A PAR: 6 PE PEA PD NPS THN WHEAT NATVEIITE hi O9F 0 % Prabha DANTE: bode NAPS AST Preabat Wel 4d THA OVA LO Fo- ALE Eo Nobel: 1F-A5 ENED T- kat 2 PER bec PFN com's /N-C/ APS THN PhAAF COUrIT WEH(WE) IC Ateen hIMAN OLY NECK: PP MAbar PE THIN LAA COU NEC AZITNAV?: JED P 16.0 Aa ag Aveda ao FORL RPCITIN (GF NL TPLMA) AAR Pls aT = ti eee aes 4c e ram UE Prbae APS acer\" NenAns: eae TUTE CPOE OPS LCD NAN te heN EY Prange:"
        },
        {
            "page_number": 23,
            "content": "RATERS Ae Ah jational Bank of Ethiopia Annex- II ?h_. OAARE! Nddek VIR ANID TCHAD ALGHTEST A440 ANG PAR: PEND PEA LIN APNEA Nhoometi hiv 02% 0% Prabha AeAne Ne THA ALT. NIETO EE Phde+ tt am f... Pcrne PERL A een, TUTE FLEA MOREE ALM cont Per evr EE my eenrrat Gar: LTHIA- coen s (0G) Ea eh de Nay AAALEL Ndve-L VG soe? drC SBB/EI/2016 NIP B gomdit HNsA1, Pao ULI? INAEIT NAL Abs 1 Ath 3 PENANG ENT o0-A Noo-r- AwheA OL NA NI LIN THO Miro 1297, ALL Abed: 1A Ly MINS AM OL NAA Ih Fh IC ALE LVPCHAT CLUE PLEO T NTO Ab AHA UTH CULT NLC ALLITNG Aokek -bawdag aver NILMALOP PA ALI: PENIO: LL NIANEAAT AMLIAV- ar Aged Seria ese. PFORLLIAC DEL PUI ACTETTIN (NT PLLA) aah es o0% ee Se rath wry WANs AELAZAA HUTS (Phontir WIPST CEA 26 ) Aa ANA"
        },
        {
            "page_number": 24,
            "content": "PAPERS Unk 7h National Bank of Ethiopia th. a ain a. PCIRE PAR: Abooi ge ag PUD CEH LN AIAN Aacome?: hiv OT a2 Prabha haoants trast LA dood o% ATT OLS Ne THA ALL OnE ALTE MFR297, EN Ned, ML LEPAPA Pda, LIA ETN AO} NOK PEPALU LA NLA NIRINTD ICOM ee am &. HCrae 1N% PHD PEAS T LAN CAA Noor PHD PEMdO FHPAPT LIA Nhe Whit Avs AAA PBR EMER LL NEA NISEA OAALKS Adve VTA AAG? arcics KLGNE ST NTATAEAT AML AINE LEAT NER LTS BPR LDA Dee PUM ACERT AG LaAOkL/FAZ CVT bH8 PR PT My 7 TeenPAs: Atabhe, Wet cower Le PENILE dao deoPhit, corr +CH Me VE NTT A NIRENCICH TERE PLOALATT UIT ACPH 109 CPIAT NVM OL\" DAA Ah Th 2c MLL LLPCOT CLNLAT TLEME AV OP Ue Ahead UTE COVRT NEC AIT ar awed PIG N4L ove LPCITIN oan ace DANES > MA. AVALTD OT CHIT ALGAE (PATI PCTAE WTI? CPOE aps 2c) nad KOO rath ure"
        },
        {
            "page_number": 25,
            "content": "RATERS Ue Ah National Bank of Ethiopia Annex-IV. Cheque Account Closure Reporting Format . Name of Bank: Name of Branch/Sub-branch: 1, Drawer s information Father s Name PANT Ae . Grand Father s Name Paget Ag . 1.2 AccountNo. ..... 1.3 Date Account Closed. 1.4 Reporting Date 1.5 Line of Business 1.6 Tax Identification No. (TIN 1.7 Business Address 1.8 Personal Address Region ... Region Town/sub city Town/sub city . Kebele/Woreda . Kebele/Woreda House No. House No. P.O.BOX P.O.BOX TEL. NO. TEL. NO. 2. List of dishonored cheques Time Date Incident Registered Cheque Ref.No. | Amount | Name of Beneficiary First Second Third Any other 3. Action taken by the bank Blocked Amount | Warning letter Served | Penalty collected _| Remark Time (ef-subartes S110 [Date | Letter RefNo. | % | Amount First Second Third Prepared by: Approved by: Signature: Signature: Date: Date: Seal of the bank ? For company, use only Name < 12"
        },
        {
            "page_number": 26,
            "content": "a) PARRRE Ae ATH my National Bank of Ethiopia Annex-V Dishonored Cheque Information Exchanging Format Name of Bank: Month Ended: Full Name of | TIN | Cheque Date Frequency of Amount Name of | Branch s Drawer No. Presented Dishonored in Birr | Beneficiary Name Cheque a= 1 2 3 4 Prepared by: Approved by: Signature: Signature: Date: Date: Seal of the Bank 13"
        }
    ]
}